---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RampLandingNotCreated
source: html/71330941-9d5d-8496-19b7-56072ce09563.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RampLandingNotCreated Property

Beginning of run coincide with the end of previous run. Landing is not created between runs.

## Syntax (C#)
```csharp
public static FailureDefinitionId RampLandingNotCreated { get; }
```